{
  "irVersion": "1.0",
  "project": "plexusone.github.io",
  "repository": "https://github.com/plexusone/plexusone.github.io",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["plexusone"],
  "releases": [
    {
      "version": "v0.4.0",
      "date": "2026-04-20",
      "highlights": [
        { "description": "Developer tools section with browser-based utilities (Markdown Editor, DSS Viewer, JWT Editor)" },
        { "description": "Trust Center with Privacy Policy and Terms of Service for compliance" },
        { "description": "Navigation fixes for IIFE bundle compatibility and relative base URLs" }
      ],
      "added": [
        { "description": "Developer tools section with Markdown Editor, DSS Viewer, and JWT Editor at /tools/", "commit": "b0c693f" },
        { "description": "Vite static HTML plugin for serving /tools/ pages in development", "commit": "23fd9e0" },
        { "description": "Tools link added to navigation Learn dropdown", "commit": "2075287" },
        { "description": "Trust Center with Privacy Policy and Terms of Service at /trust/", "commit": "660a4bf" },
        { "description": "Privacy and Terms links added to mega menu footer", "commit": "685a417" }
      ],
      "fixed": [
        { "description": "Navigation uses IIFE bundle for `<script>` tag compatibility (ES module failed silently)", "commit": "6137414" },
        { "description": "Navigation base URL changed to relative path for local development", "commit": "c8b7466" },
        { "description": "Trust pages moved to public folder for Vite build preservation", "commit": "6f951f6" },
        { "description": "OmniLLM documentation URL updated to /omnillm-core/", "commit": "bf37ef3" }
      ],
      "documentation": [
        { "description": "MkDocs theme configuration guide with CSS variable gotcha (--md-primary-bg-color)", "commit": "4005fb3" },
        { "description": "Developer tools section documentation with structure and deployment", "commit": "bb50411" }
      ]
    },
    {
      "version": "v0.3.0",
      "date": "2026-04-05",
      "highlights": [
        { "description": "Rebrand from AgentPlexus to PlexusOne with new domain plexusone.dev" },
        { "description": "Unified navigation with Lit Web Components replacing separate React and vanilla JS implementations" },
        { "description": "71% code reduction (1,390 → 400 lines) with single source of truth for all 54+ properties" }
      ],
      "added": [
        { "description": "Lit Web Components navigation package (`packages/plexus-nav/`)", "commit": "1603e0c" },
        { "description": "Auto-initialization for MkDocs backward compatibility with `#plexus-nav-root`", "commit": "91c141c" },
        { "description": "Blog category filter with Product and Engineering classifications", "commit": "5cb507f" },
        { "description": "Blog post JSON single source of truth (`apps/web/src/data/blog-posts.json`)", "commit": "2f072ce" },
        { "description": "Case study: Achieving Design Consistency Across 54+ Properties", "commit": "73411bd" },
        { "description": "CLAUDE.md project documentation with build/deploy workflows", "commit": "eafd3f3" },
        { "description": "TypeScript declarations for `<plexus-nav>` JSX support", "commit": "1603e0c" },
        { "description": "Enterprise mega menu for Products dropdown with categorized navigation", "commit": "c5f73b9" },
        { "description": "CDN-hosted `plexusone-mkdocs.css` theme for consistent MkDocs styling", "commit": "1e9a5e1" },
        { "description": "Category-based URL routes for products (`/libraries/`, `/agents/`, `/specifications/`)", "commit": "1207b92" },
        { "description": "Libraries and Agents category listing pages", "commit": "9fde3e0" },
        { "description": "Documentation button with gradient styling on product pages", "commit": "bd52d76" },
        { "description": "Centralized `products.json` for unified navigation data", "commit": "63ae118" },
        { "description": "Documentation links for OmniVoice and PlexusOne App", "commit": "786a290" },
        { "description": "Academy section with course pages", "commit": "47cf834" },
        { "description": "Claude Code and Kiro integrations for AssistantKit", "commit": "5e1832c" },
        { "description": "Deepgram integration for OmniVoice", "commit": "04fca1c" }
      ],
      "changed": [
        { "description": "Navigation uses IIFE bundle at `/js/plexus-nav.js` for regular `<script>` tag compatibility", "commit": "91c141c" },
        { "description": "React app uses `<plexus-nav>` Web Component instead of Navbar.tsx", "commit": "1603e0c" },
        { "description": "Blog metadata consolidated from BlogPage.tsx to JSON single source of truth", "commit": "91a69c7" },
        { "description": "Atom feed generator reads from JSON single source of truth", "commit": "ad7fafc" },
        { "description": "Releases blog post reclassified from Engineering to Product category", "commit": "9b2a886" },
        { "description": "Rebrand from AgentPlexus to PlexusOne across all components", "commit": "0554eb4" },
        { "description": "Domain migration from agentplexus.dev to plexusone.dev", "commit": "2c02988" },
        { "description": "GitHub organization renamed from agentplexus to plexusone", "commit": "58a2b2d" },
        { "description": "npm packages renamed from `@agentplexus` to `@plexusone`", "commit": "f51e08b" },
        { "description": "Mega menu category headings now link to section pages", "commit": "d0e7399" },
        { "description": "Mega menu links point to marketing pages instead of docs", "commit": "1c6758f" },
        { "description": "Branding gradient swapped from One to Plexus color scheme", "commit": "b7ab5d4" },
        { "description": "Mega menu Libraries updated to OmniLLM, OmniObserve, OmniSerp, OmniVoice", "commit": "f2a5134" }
      ],
      "fixed": [
        { "description": "Navigation not appearing on MkDocs sites (auto-init for backward compatibility)", "commit": "91c141c" },
        { "description": "Duplicate H1 title in blog post rendering (strip first H1 from markdown)", "commit": "98e898a" },
        { "description": "Remove unnecessary Stable/Beta pills from product cards", "commit": "f357314" },
        { "description": "Section pages now use products.json as single source of truth", "commit": "d0e7399" },
        { "description": "Mobile menu missing Agents category and incorrect Libraries URL", "commit": "6d1edd2" },
        { "description": "MkDocs search bar text visibility in dark mode (--md-primary-bg-color)", "commit": "c30298e" },
        { "description": "PlexusOne App docsUrl pointing to MkDocs site", "commit": "331a59c" },
        { "description": "Multi-Agent Spec docsUrl pointing to MkDocs site", "commit": "a936715" },
        { "description": "Navigation font sizes using px units for consistency", "commit": "2475663" },
        { "description": "External URLs updated for plexusone GitHub Pages migration", "commit": "15f715b" },
        { "description": "Presentation URLs updated for iframe compatibility", "commit": "ac0d555" }
      ],
      "removed": [
        { "description": "React Navbar.tsx and MegaMenu.tsx components (replaced by Lit Web Component)", "commit": "1603e0c" },
        { "description": "Vanilla JavaScript plexus-nav.js (820 lines, replaced by Lit)", "commit": "1603e0c" },
        { "description": "Orphaned files: content/data/, TODO.md, PRESENTATION.md", "commit": "bb38ae3" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2026-02-02",
      "highlights": [
        { "description": "Add Releases page with ReleaseLogViewer and Resources dropdown navigation" }
      ],
      "added": [
        { "description": "Releases page using `@grokify/releaselog` viewer from unpkg CDN", "commit": "c8872e1" },
        { "description": "Resources dropdown menu consolidating Blog, Releases, Philosophy, and RSS", "commit": "c8872e1" },
        { "description": "TODO.md with infrastructure improvement roadmap", "commit": "5740197" }
      ],
      "changed": [
        { "description": "Navigation reduced from 8 top-level items to 5 with Resources dropdown", "commit": "c8872e1" },
        { "description": "Mobile menu updated with Resources section header", "commit": "c8872e1" }
      ],
      "removed": [
        { "description": "Duplicate SVG tools (migrated to github.com/grokify/brandkit)", "commit": "d10f852" }
      ],
      "fixed": [
        { "description": "GitHub Actions artifact path corrected from `dist` to `docs`", "commit": "ca880de" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-01-04",
      "highlights": [
        { "description": "Initial release of AgentPlexus website with projects, integrations, blog, and MCP pages" }
      ],
      "added": [
        { "description": "React-based website with Tailwind CSS and dark theme", "commit": "9d7d066" },
        { "description": "Homepage with hero, products, philosophy, and getting started sections", "commit": "9d7d066" },
        { "description": "Projects page showcasing AgentPlexus repositories", "commit": "9d7d066" },
        { "description": "Integrations page with categorized integration cards", "commit": "9d7d066" },
        { "description": "Blog with Markdown support and Atom feed", "commit": "9d7d066" },
        { "description": "MCP (Model Context Protocol) servers page", "commit": "9d7d066" },
        { "description": "GitHub Pages deployment with SPA routing via 404.html", "commit": "9d7d066" },
        { "description": "AWS CDK and Pulumi integrations", "commit": "f0872fb" },
        { "description": "SVG conversion and verification tools", "commit": "f0872fb" },
        { "description": "go-opik repository branding update", "commit": "a34258c" }
      ]
    }
  ]
}
