{
  "irVersion": "1.0",
  "project": "plexusone.github.io",
  "repository": "https://github.com/plexusone/plexusone.github.io",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["plexusone"],
  "releases": [
    {
      "version": "v0.3.0",
      "date": "2026-04-05",
      "highlights": [
        { "description": "Rebrand from AgentPlexus to PlexusOne with new domain plexusone.dev" },
        { "description": "Enterprise mega menu with Products, Libraries, Agents, and Specifications" },
        { "description": "CDN-hosted MkDocs theme CSS for unified styling across documentation sites" }
      ],
      "added": [
        { "description": "Enterprise mega menu for Products dropdown with categorized navigation", "commit": "c5f73b9" },
        { "description": "Shared `plexus-nav.js` for unified navigation across MkDocs sites", "commit": "f9a5798" },
        { "description": "CDN-hosted `plexusone-mkdocs.css` theme for consistent MkDocs styling", "commit": "1e9a5e1" },
        { "description": "Category-based URL routes for products (`/libraries/`, `/agents/`, `/specifications/`)", "commit": "1207b92" },
        { "description": "Libraries and Agents category listing pages", "commit": "9fde3e0" },
        { "description": "Documentation button with gradient styling on product pages", "commit": "bd52d76" },
        { "description": "Centralized `products.json` for unified navigation data", "commit": "63ae118" },
        { "description": "Documentation links for OmniVoice and PlexusOne App", "commit": "786a290" },
        { "description": "Academy section with course pages", "commit": "47cf834" },
        { "description": "Claude Code and Kiro integrations for AssistantKit", "commit": "5e1832c" },
        { "description": "Deepgram integration for OmniVoice", "commit": "04fca1c" }
      ],
      "changed": [
        { "description": "Mega menu category headings now link to section pages", "commit": "d0e7399" },
        { "description": "Rebrand from AgentPlexus to PlexusOne across all components", "commit": "0554eb4" },
        { "description": "Domain migration from agentplexus.dev to plexusone.dev", "commit": "2c02988" },
        { "description": "GitHub organization renamed from agentplexus to plexusone", "commit": "58a2b2d" },
        { "description": "npm packages renamed from `@agentplexus` to `@plexusone`", "commit": "f51e08b" },
        { "description": "Mega menu links point to marketing pages instead of docs", "commit": "1c6758f" },
        { "description": "Branding gradient swapped from One to Plexus color scheme", "commit": "b7ab5d4" },
        { "description": "Mega menu Libraries updated to OmniLLM, OmniObserve, OmniSerp, OmniVoice", "commit": "f2a5134" }
      ],
      "fixed": [
        { "description": "Remove unnecessary Stable/Beta pills from product cards", "commit": "f357314" },
        { "description": "Section pages now use products.json as single source of truth", "commit": "d0e7399" },
        { "description": "Mobile menu missing Agents category and incorrect Libraries URL", "commit": "6d1edd2" },
        { "description": "MkDocs search bar text visibility in dark mode (--md-primary-bg-color)", "commit": "c30298e" },
        { "description": "PlexusOne App docsUrl pointing to MkDocs site", "commit": "331a59c" },
        { "description": "Multi-Agent Spec docsUrl pointing to MkDocs site", "commit": "a936715" },
        { "description": "Navigation font sizes using px units for consistency", "commit": "2475663" },
        { "description": "External URLs updated for plexusone GitHub Pages migration", "commit": "15f715b" },
        { "description": "Presentation URLs updated for iframe compatibility", "commit": "ac0d555" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2026-02-02",
      "highlights": [
        { "description": "Add Releases page with ReleaseLogViewer and Resources dropdown navigation" }
      ],
      "added": [
        { "description": "Releases page using `@grokify/releaselog` viewer from unpkg CDN", "commit": "c8872e1" },
        { "description": "Resources dropdown menu consolidating Blog, Releases, Philosophy, and RSS", "commit": "c8872e1" },
        { "description": "TODO.md with infrastructure improvement roadmap", "commit": "5740197" }
      ],
      "changed": [
        { "description": "Navigation reduced from 8 top-level items to 5 with Resources dropdown", "commit": "c8872e1" },
        { "description": "Mobile menu updated with Resources section header", "commit": "c8872e1" }
      ],
      "removed": [
        { "description": "Duplicate SVG tools (migrated to github.com/grokify/brandkit)", "commit": "d10f852" }
      ],
      "fixed": [
        { "description": "GitHub Actions artifact path corrected from `dist` to `docs`", "commit": "ca880de" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-01-04",
      "highlights": [
        { "description": "Initial release of AgentPlexus website with projects, integrations, blog, and MCP pages" }
      ],
      "added": [
        { "description": "React-based website with Tailwind CSS and dark theme", "commit": "9d7d066" },
        { "description": "Homepage with hero, products, philosophy, and getting started sections", "commit": "9d7d066" },
        { "description": "Projects page showcasing AgentPlexus repositories", "commit": "9d7d066" },
        { "description": "Integrations page with categorized integration cards", "commit": "9d7d066" },
        { "description": "Blog with Markdown support and Atom feed", "commit": "9d7d066" },
        { "description": "MCP (Model Context Protocol) servers page", "commit": "9d7d066" },
        { "description": "GitHub Pages deployment with SPA routing via 404.html", "commit": "9d7d066" },
        { "description": "AWS CDK and Pulumi integrations", "commit": "f0872fb" },
        { "description": "SVG conversion and verification tools", "commit": "f0872fb" },
        { "description": "go-opik repository branding update", "commit": "a34258c" }
      ]
    }
  ]
}
